app/controllers/hero_powers_controller.rb

SELECT "hero_powers".* FROM "hero_powers"
---
    def index
        hero_powers= HeroPower.all